MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1508/mcu.h
extern volatile CLC3CONbits_t CLC3CONbits __at(0xF20);
// bitfield macros
#define _CLC3CON_LC3MODE0_POSN                              0x0
#define _CLC3CON_LC3MODE0_POSITION                          0x0
#define _CLC3CON_LC3MODE0_SIZE                              0x1
#define _CLC3CON_LC3MODE0_LENGTH                            0x1
#define _CLC3CON_LC3MODE0_MASK                              0x1
#define _CLC3CON_LC3MODE1_POSN                              0x1
#define _CLC3CON_LC3MODE1_POSITION                          0x1
#define _CLC3CON_LC3MODE1_SIZE                              0x1
#define _CLC3CON_LC3MODE1_LENGTH                            0x1
#define _CLC3CON_LC3MODE1_MASK                              0x2
#define _CLC3CON_LC3MODE2_POSN                              0x2
#define _CLC3CON_LC3MODE2_POSITION                          0x2
#define _CLC3CON_LC3MODE2_SIZE                              0x1
#define _CLC3CON_LC3MODE2_LENGTH                            0x1
#define _CLC3CON_LC3MODE2_MASK                              0x4
#define _CLC3CON_LC3INTN_POSN                               0x3
#define _CLC3CON_LC3INTN_POSITION                           0x3
#define _CLC3CON_LC3INTN_SIZE                               0x1
#define _CLC3CON_LC3INTN_LENGTH                             0x1
#define _CLC3CON_LC3INTN_MASK                               0x8
#define _CLC3CON_LC3INTP_POSN                               0x4
#define _CLC3CON_LC3INTP_POSITION                           0x4
#define _CLC3CON_LC3INTP_SIZE                               0x1
#define _CLC3CON_LC3INTP_LENGTH                             0x1
#define _CLC3CON_LC3INTP_MASK                               0x10
#define _CLC3CON_LC3OUT_POSN                                0x5
#define _CLC3CON_LC3OUT_POSITION                            0x5
#define _CLC3CON_LC3OUT_SIZE                                0x1
#define _CLC3CON_LC3OUT_LENGTH                              0x1
#define _CLC3CON_LC3OUT_MASK                                0x20
#define _CLC3CON_LC3OE_POSN                                 0x6
#define _CLC3CON_LC3OE_POSITION                             0x6
#define _CLC3CON_LC3OE_SIZE                                 0x1
#define _CLC3CON_LC3OE_LENGTH                               0x1
#define _CLC3CON_LC3OE_MASK                                 0x40
#define _CLC3CON_LC3EN_POSN                                 0x7
#define _CLC3CON_LC3EN_POSITION                             0x7
#define _CLC3CON_LC3EN_SIZE                                 0x1
#define _CLC3CON_LC3EN_LENGTH                               0x1
#define _CLC3CON_LC3EN_MASK                                 0x80
#define _CLC3CON_LCMODE0_POSN                               0x0
#define _CLC3CON_LCMODE0_POSITION                           0x0
#define _CLC3CON_LCMODE0_SIZE                               0x1
#define _CLC3CON_LCMODE0_LENGTH                             0x1
#define _CLC3CON_LCMODE0_MASK                               0x1
#define _CLC3CON_LCMODE1_POSN                               0x1
#define _CLC3CON_LCMODE1_POSITION                           0x1
#define _CLC3CON_LCMODE1_SIZE                               0x1
#define _CLC3CON_LCMODE1_LENGTH                             0x1
#define _CLC3CON_LCMODE1_MASK                               0x2
#define _CLC3CON_LCMODE2_POSN                               0x2
#define _CLC3CON_LCMODE2_POSITION                           0x2
#define _CLC3CON_LCMODE2_SIZE                               0x1
#define _CLC3CON_LCMODE2_LENGTH                             0x1
#define _CLC3CON_LCMODE2_MASK                               0x4
#define _CLC3CON_LCINTN_POSN                                0x3
#define _CLC3CON_LCINTN_POSITION                            0x3
#define _CLC3CON_LCINTN_SIZE                                0x1
#define _CLC3CON_LCINTN_LENGTH                              0x1
#define _CLC3CON_LCINTN_MASK                                0x8
#define _CLC3CON_LCINTP_POSN                                0x4
#define _CLC3CON_LCINTP_POSITION                            0x4
#define _CLC3CON_LCINTP_SIZE                                0x1
#define _CLC3CON_LCINTP_LENGTH                              0x1
#define _CLC3CON_LCINTP_MASK                                0x10
#define _CLC3CON_LCOUT_POSN                                 0x5
#define _CLC3CON_LCOUT_POSITION                             0x5
#define _CLC3CON_LCOUT_SIZE                                 0x1
#define _CLC3CON_LCOUT_LENGTH                               0x1
#define _CLC3CON_LCOUT_MASK                                 0x20
#define _CLC3CON_LCOE_POSN                                  0x6
#define _CLC3CON_LCOE_POSITION                              0x6
#define _CLC3CON_LCOE_SIZE                                  0x1
#define _CLC3CON_LCOE_LENGTH                                0x1
#define _CLC3CON_LCOE_MASK                                  0x40
#define _CLC3CON_LCEN_POSN                                  0x7
#define _CLC3CON_LCEN_POSITION                              0x7
#define _CLC3CON_LCEN_SIZE                                  0x1
#define _CLC3CON_LCEN_LENGTH                                0x1
#define _CLC3CON_LCEN_MASK                                  0x80
#define _CLC3CON_LC3MODE_POSN                               0x0
#define _CLC3CON_LC3MODE_POSITION                           0x0
#define _CLC3CON_LC3MODE_SIZE                               0x3
#define _CLC3CON_LC3MODE_LENGTH                             0x3
#define _CLC3CON_LC3MODE_MASK                               0x7

// Register: CLC3POL
#define CLC3POL CLC3POL
extern volatile unsigned char           CLC3POL             __at(0xF21);
#ifndef _LIB_BUILD
asm("CLC3POL equ 0F21h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned LC3G1POL               :1;
        unsigned LC3G2POL               :1;
        unsigned LC3G3POL               :1;
        unsigned LC3G4POL               :1;
        unsigned                        :3;
        unsigned LC3POL                 :1;
    };
    struct {
        unsigned G1POL                  :1;
        unsigned G2POL                  :1;
        unsigned G3POL                  :1;
        unsigned G4POL                  :1;
        unsigned                        :3;
        unsigned POL                    :1;
    };
} CLC3POLbits_t;
extern volatile CLC3POLbits_t CLC3POLbits __at(0xF21);
// bitfield macros
#define _CLC3POL_LC3G1POL_POSN                              0x0
#define _CLC3POL_LC3G1POL_POSITION                          0x0
#define _CLC3POL_LC3G1POL_SIZE                              0x1
#define _CLC3POL_LC3G1POL_LENGTH                            0x1
#define _CLC3POL_LC3G1POL_MASK                              0x1
#define _CLC3POL_LC3G2POL_POSN                              0x1
#define _CLC3POL_LC3G2POL_POSITION                          0x1
#define _CLC3POL_LC3G2POL_SIZE                              0x1
#define _CLC3POL_LC3G2POL_LENGTH                            0x1
#define _CLC3POL_LC3G2POL_MASK                              0x2
#define _CLC3POL_LC3G3POL_POSN                              0x2
#define _CLC3POL_LC3G3POL_POSITION                          0x2
#define _CLC3POL_LC3G3POL_SIZE                              0x1
#define _CLC3POL_LC3G3POL_LENGTH                            0x1
#define _CLC3POL_LC3G3POL_MASK                              0x4
#define _CLC3POL_LC3G4POL_POSN                              0x3
#define _CLC3POL_LC3G4POL_POSITION                          0x3
#define _CLC3POL_LC3G4POL_SIZE                              0x1
#define _CLC3POL_LC3G4POL_LENGTH                            0x1
#define _CLC3POL_LC3G4POL_MASK                              0x8
#define _CLC3POL_LC3POL_POSN                                0x7
#define _CLC3POL_LC3POL_POSITION                            0x7
#define _CLC3POL_LC3POL_SIZE                                0x1
#define _CLC3POL_LC3POL_LENGTH                              0x1
#define _CLC3POL_LC3POL_MASK                                0x80
#define _CLC3POL_G1POL_POSN                                 0x0
#define _CLC3POL_G1POL_POSITION                             0x0
#define _CLC3POL_G1POL_SIZE                                 0x1
#define _CLC3POL_G1POL_LENGTH                               0x1
#define _CLC3POL_G1POL_MASK                                 0x1
#define _CLC3POL_G2POL_POSN                                 0x1
#define _CLC3POL_G2POL_POSITION                             0x1
#define _CLC3POL_G2POL_SIZE                                 0x1
#define _CLC3POL_G2POL_LENGTH                               0x1
#define _CLC3POL_G2POL_MASK                                 0x2
#define _CLC3POL_G3POL_POSN                                 0x2
#define _CLC3POL_G3POL_POSITION                             0x2
#define _CLC3POL_G3POL_SIZE                                 0x1
#define _CLC3POL_G3POL_LENGTH                               0x1
#define _CLC3POL_G3POL_MASK                                 0x4
#define _CLC3POL_G4POL_POSN                                 0x3
#define _CLC3POL_G4POL_POSITION                             0x3
#define _CLC3POL_G4POL_SIZE                                 0x1
#define _CLC3POL_G4POL_LENGTH                               0x1
#define _CLC3POL_G4POL_MASK                                 0x8
#define _CLC3POL_POL_POSN                                   0x7
#define _CLC3POL_POL_POSITION                               0x7
#define _CLC3POL_POL_SIZE                                   0x1
#define _CLC3POL_POL_LENGTH                                 0x1
#define _CLC3POL_POL_MASK                                   0x80

// Register: CLC3SEL0
#define CLC3SEL0 CLC3SEL0
extern volatile unsigned char           CLC3SEL0            __at(0xF22);
#ifndef _LIB_BUILD
asm("CLC3SEL0 equ 0F22h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned LC3D1S0                :1;
        unsigned LC3D1S1                :1;
        unsigned LC3D1S2                :1;
        unsigned                        :1;
        unsigned LC3D2S0                :1;
        unsigned LC3D2S1                :1;
        unsigned LC3D2S2                :1;
    };
    struct {
        unsigned D1S0                   :1;
        unsigned D1S1                   :1;
        unsigned D1S2                   :1;
        unsigned                        :1;
        unsigned D2S0                   :1;
        unsigned D2S1                   :1;
        unsigned D2S2                   :1;
    };
    struct {
        unsigned LC3D1S                 :3;
        unsigned                        :1;
        unsigned LC3D2S                 :3;
    };
} CLC3SEL0bits_t;
extern volatile CLC3SEL0bits_t CLC3SEL0bits __at(0xF22);
// bitfield macros
#define _CLC3SEL0_LC3D1S0_POSN                              0x0
#define _CLC3SEL0_LC3D1S0_POSITION                          0x0
#define _CLC3SEL0_LC3D1S0_SIZE                              0x1
#define _CLC3SEL0_LC3D1S0_LENGTH                            0x1
#define _CLC3SEL0_LC3D1S0_MASK                              0x1
#define _CLC3SEL0_LC3D1S1_POSN                              0x1
#define _CLC3SEL0_LC3D1S1_POSITION                          0x1
#define _CLC3SEL0_LC3D1S1_SIZE                              0x1
#define _CLC3SEL0_LC3D1S1_LENGTH                            0x1
#define _CLC3SEL0_LC3D1S1_MASK                              0x2
#define _CLC3SEL0_LC3D1S2_POSN                              0x2
#define _CLC3SEL0_LC3D1S2_POSITION                          0x2
#define _CLC3SEL0_LC3D1S2_SIZE                              0x1
#define _CLC3SEL0_LC3D1S2_LENGTH                            0x1
#define _CLC3SEL0_LC3D1S2_MASK                              0x4
#define _CLC3SEL0_LC3D2S0_POSN                              0x4
#define _CLC3SEL0_LC3D2S0_POSITION                          0x4
#define _CLC3SEL0_LC3D2S0_SIZE                              0x1
#define _CLC3SEL0_LC3D2S0_LENGTH                            0x1
#define _CLC3SEL0_LC3D2S0_MASK                              0x10
#define _CLC3SEL0_LC3D2S1_POSN                              0x5
#define _CLC3SEL0_LC3D2S1_POSITION                          0x5
#define _CLC3SEL0_LC3D2S1_SIZE                              0x1
#define _CLC3SEL0_LC3D2S1_LENGTH                            0x1
#define _CLC3SEL0_LC3D2S1_MASK                              0x20
#define _CLC3SEL0_LC3D2S2_POSN                              0x6
#define _CLC3SEL0_LC3D2S2_POSITION                          0x6
#define _CLC3SEL0_LC3D2S2_SIZE                              0x1
#define _CLC3SEL0_LC3D2S2_LENGTH                            0x1
#define _CLC3SEL0_LC3D2S2_MASK                              0x40
#define _CLC3SEL0_D1S0_POSN                                 0x0
#define _CLC3SEL0_D1S0_POSITION                             0x0
#define _CLC3SEL0_D1S0_SIZE                                 0x1
#define _CLC3SEL0_D1S0_LENGTH                               0x1
#define _CLC3SEL0_D1S0_MASK                                 0x1
#define _CLC3SEL0_D1S1_POSN                                 0x1
#define _CLC3SEL0_D1S1_POSITION                             0x1
#define _CLC3SEL0_D1S1_SIZE                                 0x1
#define _CLC3SEL0_D1S1_LENGTH                               0x1
#define _CLC3SEL0_D1S1_MASK                                 0x2
#define _CLC3SEL0_D1S2_POSN                                 0x2
#define _CLC3SEL0_D1S2_POSITION                             0x2
#define _CLC3SEL0_D1S2_SIZE                                 0x1
#define _CLC3SEL0_D1S2_LENGTH                               0x1
#define _CLC3SEL0_D1S2_MASK                                 0x4
#define _CLC3SEL0_D2S0_POSN                                 0x4
#define _CLC3SEL0_D2S0_POSITION                             0x4
#define _CLC3SEL0_D2S0_SIZE                                 0x1
#define _CLC3SEL0_D2S0_LENGTH                               0x1
#define _CLC3SEL0_D2S0_MASK                                 0x10
#define _CLC3SEL0_D2S1_POSN                                 0x5
#define _CLC3SEL0_D2S1_POSITION                             0x5
#define _CLC3SEL0_D2S1_SIZE                                 0x1
#define _CLC3SEL0_D2S1_LENGTH                               0x1
#define _CLC3SEL0_D2S1_MASK                                 0x20
#define _CLC3SEL0_D2S2_POSN                                 0x6
#define _CLC3SEL0_D2S2_POSITION                             0x6
#define _CLC3SEL0_D2S2_SIZE                                 0x1
#define _CLC3SEL0_D2S2_LENGTH                               0x1
#define _CLC3SEL0_D2S2_MASK                                 0x40
#define _CLC3SEL0_LC3D1S_POSN                               0x0
#define _CLC3SEL0_LC3D1S_POSITION                           0x0
#define _CLC3SEL0_LC3D1S_SIZE                               0x3
#define _CLC3SEL0_LC3D1S_LENGTH                             0x3
#define _CLC3SEL0_LC3D1S_MASK                               0x7
#define _CLC3SEL0_LC3D2S_POSN                               0x4
#define _CLC3SEL0_LC3D2S_POSITION                           0x4
#define _CLC3SEL0_LC3D2S_SIZE                               0x3
#define _CLC3SEL0_LC3D2S_LENGTH                             0x3
#define _CLC3SEL0_LC3D2S_MASK                               0x70

// Register: CLC3SEL1
#define CLC3SEL1 CLC3SEL1
extern volatile unsigned char           CLC3SEL1            __at(0xF23);
#ifndef _LIB_BUILD
asm("CLC3SEL1 equ 0F23h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned LC3D3S0                :1;
        unsigned LC3D3S1                :1;
        unsigned LC3D3S2                :1;
        unsigned                        :1;
        unsigned LC3D4S0                :1;
        unsigned LC3D4S1                :1;
        unsigned LC3D4S2                :1;
    };
    struct {
        unsigned D3S0                   :1;
        unsigned D3S1                   :1;
        unsigned D3S2                   :1;
        unsigned                        :1;
        unsigned D4S0                   :1;
        unsigned D4S1                   :1;
        unsigned D4S2                   :1;
    };
    struct {
        unsigned LC3D3S                 :3;
        unsigned                        :1;
        unsigned LC3D4S                 :3;
    };
} CLC3SEL1bits_t;
extern volatile CLC3SEL1bits_t CLC3SEL1bits __at(0xF23);
// bitfield macros
#define _CLC3SEL1_LC3D3S0_POSN                              0x0
#define _CLC3SEL1_LC3D3S0_POSITION                          0x0
#define _CLC3SEL1_LC3D3S0_SIZE                              0x1
#define _CLC3SEL1_LC3D3S0_LENGTH                            0x1
#define _CLC3SEL1_LC3D3S0_MASK                              0x1
#define _CLC3SEL1_LC3D3S1_POSN                              0x1
#define _CLC3SEL1_LC3D3S1_POSITION                          0x1
#define _CLC3SEL1_LC3D3S1_SIZE                              0x1
#define _CLC3SEL1_LC3D3S1_LENGTH                            0x1
#define _CLC3SEL1_LC3D3S1_MASK                              0x2
#define _CLC3SEL1_LC3D3S2_POSN                              0x2
#define _CLC3SEL1_LC3D3S2_POSITION                          0x2
#define _CLC3SEL1_LC3D3S2_SIZE                              0x1
#define _CLC3SEL1_LC3D3S2_LENGTH                            0x1
#define _CLC3SEL1_LC3D3S2_MASK                              0x4
#define _CLC3SEL1_LC3D4S0_POSN                              0x4
#define _CLC3SEL1_LC3D4S0_POSITION                          0x4
#define _CLC3SEL1_LC3D4S0_SIZE                              0x1
#define _CLC3SEL1_LC3D4S0_LENGTH                            0x1
#define _CLC3SEL1_LC3D4S0_MASK                              0x10
#define _CLC3SEL1_LC3D4S1_POSN                              0x5
#define _CLC3SEL1_LC3D4S1_POSITION                          0x5
#define _CLC3SEL1_LC3D4S1_SIZE                              0x1
#define _CLC3SEL1_LC3D4S1_LENGTH                            0x1
#define _CLC3SEL1_LC3D4S1_MASK                              0x20
#define _CLC3SEL1_LC3D4S2_POSN                              0x6
#define _CLC3SEL1_LC3D4S2_POSITION                          0x6
#define _CLC3SEL1_LC3D4S2_SIZE                              0x1
#define _CLC3SEL1_LC3D4S2_LENGTH                            0x1
#define _CLC3SEL1_LC3D4S2_MASK                              0x40
#define _CLC3SEL1_D3S0_POSN                                 0x0
#define _CLC3SEL1_D3S0_POSITION                             0x0
#define _CLC3SEL1_D3S0_SIZE                                 0x1
#define _CLC3SEL1_D3S0_LENGTH                               0x1
#define _CLC3SEL1_D3S0_MASK                                 0x1
#define _CLC3SEL1_D3S1_POSN                                 0x1
#define _CLC3SEL1_D3S1_POSITION                             0x1
#define _CLC3SEL1_D3S1_SIZE                                 0x1
#define _CLC3SEL1_D3S1_LENGTH                               0x1
#define _CLC3SEL1_D3S1_MASK                                 0x2
#define _CLC3SEL1_D3S2_POSN                                 0x2
#define _CLC3SEL1_D3S2_POSITION                             0x2
#define _CLC3SEL1_D3S2_SIZE                                 0x1
#define _CLC3SEL1_D3S2_LENGTH                               0x1
#define _CLC3SEL1_D3S2_MASK                                 0x4
#define _CLC3SEL1_D4S0_POSN                                 0x4
#define _CLC3SEL1_D4S0_POSITION                             0x4
#define _CLC3SEL1_D4S0_SIZE                                 0x1
#define _CLC3SEL1_D4S0_LENGTH                               0x1
#define _CLC3SEL1_D4S0_MASK                                 0x10
#define _CLC3SEL1_D4S1_POSN                                 0x5
#define _CLC3SEL1_D4S1_POSITION                             0x5
#define _CLC3SEL1_D4S1_SIZE                                 0x1
#define _CLC3SEL1_D4S1_LENGTH                               0x1
#define _CLC3SEL1_D4S1_MASK                                 0x20
#define _CLC3SEL1_D4S2_POSN                                 0x6
#define _CLC3SEL1_D4S2_POSITION                             0x6
#define _CLC3SEL1_D4S2_SIZE                                 0x1
#define _CLC3SEL1_D4S2_LENGTH                               0x1
#define _CLC3SEL1_D4S2_MASK                                 0x40
#define _CLC3SEL1_LC3D3S_POSN                               0x0
#define _CLC3SEL1_LC3D3S_POSITION                           0x0
#define _CLC3SEL1_LC3D3S_SIZE                               0x3
#define _CLC3SEL1_LC3D3S_LENGTH                             0x3
#define _CLC3SEL1_LC3D3S_MASK                               0x7
#define _CLC3SEL1_LC3D4S_POSN                               0x4
#define _CLC3SEL1_LC3D4S_POSITION                           0x4
#define _CLC3SEL1_LC3D4S_SIZE                               0x3
#define _CLC3SEL1_LC3D4S_LENGTH                             0x3
#define _CLC3SEL1_LC3D4S_MASK                               0x70

