MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1508/mcu.h
extern volatile CLC4POLbits_t CLC4POLbits __at(0xF29);
// bitfield macros
#define _CLC4POL_LC4G1POL_POSN                              0x0
#define _CLC4POL_LC4G1POL_POSITION                          0x0
#define _CLC4POL_LC4G1POL_SIZE                              0x1
#define _CLC4POL_LC4G1POL_LENGTH                            0x1
#define _CLC4POL_LC4G1POL_MASK                              0x1
#define _CLC4POL_LC4G2POL_POSN                              0x1
#define _CLC4POL_LC4G2POL_POSITION                          0x1
#define _CLC4POL_LC4G2POL_SIZE                              0x1
#define _CLC4POL_LC4G2POL_LENGTH                            0x1
#define _CLC4POL_LC4G2POL_MASK                              0x2
#define _CLC4POL_LC4G3POL_POSN                              0x2
#define _CLC4POL_LC4G3POL_POSITION                          0x2
#define _CLC4POL_LC4G3POL_SIZE                              0x1
#define _CLC4POL_LC4G3POL_LENGTH                            0x1
#define _CLC4POL_LC4G3POL_MASK                              0x4
#define _CLC4POL_LC4G4POL_POSN                              0x3
#define _CLC4POL_LC4G4POL_POSITION                          0x3
#define _CLC4POL_LC4G4POL_SIZE                              0x1
#define _CLC4POL_LC4G4POL_LENGTH                            0x1
#define _CLC4POL_LC4G4POL_MASK                              0x8
#define _CLC4POL_LC4POL_POSN                                0x7
#define _CLC4POL_LC4POL_POSITION                            0x7
#define _CLC4POL_LC4POL_SIZE                                0x1
#define _CLC4POL_LC4POL_LENGTH                              0x1
#define _CLC4POL_LC4POL_MASK                                0x80
#define _CLC4POL_G1POL_POSN                                 0x0
#define _CLC4POL_G1POL_POSITION                             0x0
#define _CLC4POL_G1POL_SIZE                                 0x1
#define _CLC4POL_G1POL_LENGTH                               0x1
#define _CLC4POL_G1POL_MASK                                 0x1
#define _CLC4POL_G2POL_POSN                                 0x1
#define _CLC4POL_G2POL_POSITION                             0x1
#define _CLC4POL_G2POL_SIZE                                 0x1
#define _CLC4POL_G2POL_LENGTH                               0x1
#define _CLC4POL_G2POL_MASK                                 0x2
#define _CLC4POL_G3POL_POSN                                 0x2
#define _CLC4POL_G3POL_POSITION                             0x2
#define _CLC4POL_G3POL_SIZE                                 0x1
#define _CLC4POL_G3POL_LENGTH                               0x1
#define _CLC4POL_G3POL_MASK                                 0x4
#define _CLC4POL_G4POL_POSN                                 0x3
#define _CLC4POL_G4POL_POSITION                             0x3
#define _CLC4POL_G4POL_SIZE                                 0x1
#define _CLC4POL_G4POL_LENGTH                               0x1
#define _CLC4POL_G4POL_MASK                                 0x8
#define _CLC4POL_POL_POSN                                   0x7
#define _CLC4POL_POL_POSITION                               0x7
#define _CLC4POL_POL_SIZE                                   0x1
#define _CLC4POL_POL_LENGTH                                 0x1
#define _CLC4POL_POL_MASK                                   0x80

// Register: CLC4SEL0
#define CLC4SEL0 CLC4SEL0
extern volatile unsigned char           CLC4SEL0            __at(0xF2A);
#ifndef _LIB_BUILD
asm("CLC4SEL0 equ 0F2Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned LC4D1S0                :1;
        unsigned LC4D1S1                :1;
        unsigned LC4D1S2                :1;
        unsigned                        :1;
        unsigned LC4D2S0                :1;
        unsigned LC4D2S1                :1;
        unsigned LC4D2S2                :1;
    };
    struct {
        unsigned D1S0                   :1;
        unsigned D1S1                   :1;
        unsigned D1S2                   :1;
        unsigned                        :1;
        unsigned D2S0                   :1;
        unsigned D2S1                   :1;
        unsigned D2S2                   :1;
    };
    struct {
        unsigned LC4D1S                 :3;
        unsigned                        :1;
        unsigned LC4D2S                 :3;
    };
} CLC4SEL0bits_t;
extern volatile CLC4SEL0bits_t CLC4SEL0bits __at(0xF2A);
// bitfield macros
#define _CLC4SEL0_LC4D1S0_POSN                              0x0
#define _CLC4SEL0_LC4D1S0_POSITION                          0x0
#define _CLC4SEL0_LC4D1S0_SIZE                              0x1
#define _CLC4SEL0_LC4D1S0_LENGTH                            0x1
#define _CLC4SEL0_LC4D1S0_MASK                              0x1
#define _CLC4SEL0_LC4D1S1_POSN                              0x1
#define _CLC4SEL0_LC4D1S1_POSITION                          0x1
#define _CLC4SEL0_LC4D1S1_SIZE                              0x1
#define _CLC4SEL0_LC4D1S1_LENGTH                            0x1
#define _CLC4SEL0_LC4D1S1_MASK                              0x2
#define _CLC4SEL0_LC4D1S2_POSN                              0x2
#define _CLC4SEL0_LC4D1S2_POSITION                          0x2
#define _CLC4SEL0_LC4D1S2_SIZE                              0x1
#define _CLC4SEL0_LC4D1S2_LENGTH                            0x1
#define _CLC4SEL0_LC4D1S2_MASK                              0x4
#define _CLC4SEL0_LC4D2S0_POSN                              0x4
#define _CLC4SEL0_LC4D2S0_POSITION                          0x4
#define _CLC4SEL0_LC4D2S0_SIZE                              0x1
#define _CLC4SEL0_LC4D2S0_LENGTH                            0x1
#define _CLC4SEL0_LC4D2S0_MASK                              0x10
#define _CLC4SEL0_LC4D2S1_POSN                              0x5
#define _CLC4SEL0_LC4D2S1_POSITION                          0x5
#define _CLC4SEL0_LC4D2S1_SIZE                              0x1
#define _CLC4SEL0_LC4D2S1_LENGTH                            0x1
#define _CLC4SEL0_LC4D2S1_MASK                              0x20
#define _CLC4SEL0_LC4D2S2_POSN                              0x6
#define _CLC4SEL0_LC4D2S2_POSITION                          0x6
#define _CLC4SEL0_LC4D2S2_SIZE                              0x1
#define _CLC4SEL0_LC4D2S2_LENGTH                            0x1
#define _CLC4SEL0_LC4D2S2_MASK                              0x40
#define _CLC4SEL0_D1S0_POSN                                 0x0
#define _CLC4SEL0_D1S0_POSITION                             0x0
#define _CLC4SEL0_D1S0_SIZE                                 0x1
#define _CLC4SEL0_D1S0_LENGTH                               0x1
#define _CLC4SEL0_D1S0_MASK                                 0x1
#define _CLC4SEL0_D1S1_POSN                                 0x1
#define _CLC4SEL0_D1S1_POSITION                             0x1
#define _CLC4SEL0_D1S1_SIZE                                 0x1
#define _CLC4SEL0_D1S1_LENGTH                               0x1
#define _CLC4SEL0_D1S1_MASK                                 0x2
#define _CLC4SEL0_D1S2_POSN                                 0x2
#define _CLC4SEL0_D1S2_POSITION                             0x2
#define _CLC4SEL0_D1S2_SIZE                                 0x1
#define _CLC4SEL0_D1S2_LENGTH                               0x1
#define _CLC4SEL0_D1S2_MASK                                 0x4
#define _CLC4SEL0_D2S0_POSN                                 0x4
#define _CLC4SEL0_D2S0_POSITION                             0x4
#define _CLC4SEL0_D2S0_SIZE                                 0x1
#define _CLC4SEL0_D2S0_LENGTH                               0x1
#define _CLC4SEL0_D2S0_MASK                                 0x10
#define _CLC4SEL0_D2S1_POSN                                 0x5
#define _CLC4SEL0_D2S1_POSITION                             0x5
#define _CLC4SEL0_D2S1_SIZE                                 0x1
#define _CLC4SEL0_D2S1_LENGTH                               0x1
#define _CLC4SEL0_D2S1_MASK                                 0x20
#define _CLC4SEL0_D2S2_POSN                                 0x6
#define _CLC4SEL0_D2S2_POSITION                             0x6
#define _CLC4SEL0_D2S2_SIZE                                 0x1
#define _CLC4SEL0_D2S2_LENGTH                               0x1
#define _CLC4SEL0_D2S2_MASK                                 0x40
#define _CLC4SEL0_LC4D1S_POSN                               0x0
#define _CLC4SEL0_LC4D1S_POSITION                           0x0
#define _CLC4SEL0_LC4D1S_SIZE                               0x3
#define _CLC4SEL0_LC4D1S_LENGTH                             0x3
#define _CLC4SEL0_LC4D1S_MASK                               0x7
#define _CLC4SEL0_LC4D2S_POSN                               0x4
#define _CLC4SEL0_LC4D2S_POSITION                           0x4
#define _CLC4SEL0_LC4D2S_SIZE                               0x3
#define _CLC4SEL0_LC4D2S_LENGTH                             0x3
#define _CLC4SEL0_LC4D2S_MASK                               0x70

// Register: CLC4SEL1
#define CLC4SEL1 CLC4SEL1
extern volatile unsigned char           CLC4SEL1            __at(0xF2B);
#ifndef _LIB_BUILD
asm("CLC4SEL1 equ 0F2Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned LC4D3S0                :1;
        unsigned LC4D3S1                :1;
        unsigned LC4D3S2                :1;
        unsigned                        :1;
        unsigned LC4D4S0                :1;
        unsigned LC4D4S1                :1;
        unsigned LC4D4S2                :1;
    };
    struct {
        unsigned D3S0                   :1;
        unsigned D3S1                   :1;
        unsigned D3S2                   :1;
        unsigned                        :1;
        unsigned D4S0                   :1;
        unsigned D4S1                   :1;
        unsigned D4S2                   :1;
    };
    struct {
        unsigned LC4D3S                 :3;
        unsigned                        :1;
        unsigned LC4D4S                 :3;
    };
} CLC4SEL1bits_t;
extern volatile CLC4SEL1bits_t CLC4SEL1bits __at(0xF2B);
// bitfield macros
#define _CLC4SEL1_LC4D3S0_POSN                              0x0
#define _CLC4SEL1_LC4D3S0_POSITION                          0x0
#define _CLC4SEL1_LC4D3S0_SIZE                              0x1
#define _CLC4SEL1_LC4D3S0_LENGTH                            0x1
#define _CLC4SEL1_LC4D3S0_MASK                              0x1
#define _CLC4SEL1_LC4D3S1_POSN                              0x1
#define _CLC4SEL1_LC4D3S1_POSITION                          0x1
#define _CLC4SEL1_LC4D3S1_SIZE                              0x1
#define _CLC4SEL1_LC4D3S1_LENGTH                            0x1
#define _CLC4SEL1_LC4D3S1_MASK                              0x2
#define _CLC4SEL1_LC4D3S2_POSN                              0x2
#define _CLC4SEL1_LC4D3S2_POSITION                          0x2
#define _CLC4SEL1_LC4D3S2_SIZE                              0x1
#define _CLC4SEL1_LC4D3S2_LENGTH                            0x1
#define _CLC4SEL1_LC4D3S2_MASK                              0x4
#define _CLC4SEL1_LC4D4S0_POSN                              0x4
#define _CLC4SEL1_LC4D4S0_POSITION                          0x4
#define _CLC4SEL1_LC4D4S0_SIZE                              0x1
#define _CLC4SEL1_LC4D4S0_LENGTH                            0x1
#define _CLC4SEL1_LC4D4S0_MASK                              0x10
#define _CLC4SEL1_LC4D4S1_POSN                              0x5
#define _CLC4SEL1_LC4D4S1_POSITION                          0x5
#define _CLC4SEL1_LC4D4S1_SIZE                              0x1
#define _CLC4SEL1_LC4D4S1_LENGTH                            0x1
#define _CLC4SEL1_LC4D4S1_MASK                              0x20
#define _CLC4SEL1_LC4D4S2_POSN                              0x6
#define _CLC4SEL1_LC4D4S2_POSITION                          0x6
#define _CLC4SEL1_LC4D4S2_SIZE                              0x1
#define _CLC4SEL1_LC4D4S2_LENGTH                            0x1
#define _CLC4SEL1_LC4D4S2_MASK                              0x40
#define _CLC4SEL1_D3S0_POSN                                 0x0
#define _CLC4SEL1_D3S0_POSITION                             0x0
#define _CLC4SEL1_D3S0_SIZE                                 0x1
#define _CLC4SEL1_D3S0_LENGTH                               0x1
#define _CLC4SEL1_D3S0_MASK                                 0x1
#define _CLC4SEL1_D3S1_POSN                                 0x1
#define _CLC4SEL1_D3S1_POSITION                             0x1
#define _CLC4SEL1_D3S1_SIZE                                 0x1
#define _CLC4SEL1_D3S1_LENGTH                               0x1
#define _CLC4SEL1_D3S1_MASK                                 0x2
#define _CLC4SEL1_D3S2_POSN                                 0x2
#define _CLC4SEL1_D3S2_POSITION                             0x2
#define _CLC4SEL1_D3S2_SIZE                                 0x1
#define _CLC4SEL1_D3S2_LENGTH                               0x1
#define _CLC4SEL1_D3S2_MASK                                 0x4
#define _CLC4SEL1_D4S0_POSN                                 0x4
#define _CLC4SEL1_D4S0_POSITION                             0x4
#define _CLC4SEL1_D4S0_SIZE                                 0x1
#define _CLC4SEL1_D4S0_LENGTH                               0x1
#define _CLC4SEL1_D4S0_MASK                                 0x10
#define _CLC4SEL1_D4S1_POSN                                 0x5
#define _CLC4SEL1_D4S1_POSITION                             0x5
#define _CLC4SEL1_D4S1_SIZE                                 0x1
#define _CLC4SEL1_D4S1_LENGTH                               0x1
#define _CLC4SEL1_D4S1_MASK                                 0x20
#define _CLC4SEL1_D4S2_POSN                                 0x6
#define _CLC4SEL1_D4S2_POSITION                             0x6
#define _CLC4SEL1_D4S2_SIZE                                 0x1
#define _CLC4SEL1_D4S2_LENGTH                               0x1
#define _CLC4SEL1_D4S2_MASK                                 0x40
#define _CLC4SEL1_LC4D3S_POSN                               0x0
#define _CLC4SEL1_LC4D3S_POSITION                           0x0
#define _CLC4SEL1_LC4D3S_SIZE                               0x3
#define _CLC4SEL1_LC4D3S_LENGTH                             0x3
#define _CLC4SEL1_LC4D3S_MASK                               0x7
#define _CLC4SEL1_LC4D4S_POSN                               0x4
#define _CLC4SEL1_LC4D4S_POSITION                           0x4
#define _CLC4SEL1_LC4D4S_SIZE                               0x3
#define _CLC4SEL1_LC4D4S_LENGTH                             0x3
#define _CLC4SEL1_LC4D4S_MASK                               0x70

